hw/hw6-acceptance-unit-test-cycle/rottenpotatoes/app/controllers/movies_controller.rb

  def same_director_movies
    begin
      match_movie = Movie.find params[:id]
      if match_movie.director == ''
        flash[:warning]= "'#{match_movie.title}' has no director info"
        redirect_to movies_path
      else
        @movies = Movie.find_same_director match_movie
---
SELECT  "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", 1]]
SELECT "movies".* FROM "movies" WHERE "movies"."director" = ?  [["director", "George Lucas"]]